doc/LAYERS.org
#+TITLE: Configuration layers
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/readtheorg.css" />

* Configuration Layers                                      :TOC_4_org:noexport:
 - [[Introduction][Introduction]]
 - [[Nomenclature][Nomenclature]]
 - [[The Emacs loading process][The Emacs loading process]]
   - [[Emacs Lisp files][Emacs Lisp files]]
     - [[Loading a file][Loading a file]]
   - [[Features][Features]]
     - [[The load path][The load path]]
   - [[Auto-loading][Auto-loading]]
   - [[Eval after load][Eval after load]]
   - [[Use-package][Use-package]]
 - [[Anatomy of a layer][Anatomy of a layer]]
   - [[packages.el][packages.el]]
   - [[config.el, funcs.el and keybindings.el][config.el, funcs.el and keybindings.el]]
 - [[The Spacemacs loading process][The Spacemacs loading process]]
 - [[Case study: auto-completion][Case study: auto-completion]]
 - [[Layer tips and tricks][Layer tips and tricks]]
   - [[Cross-dependencies][Cross-dependencies]]
   - [[Use-package][Use-package]]
   - [[Use-package hooks][Use-package hooks]]
   - [[Best practices][Best practices]]
     - [[Package ownership][Package ownership]]
     - [[Localize your configuration][Localize your configuration]]
     - [[Load ordering][Load ordering]]
     - [[No require][No require]]
     - [[Auto-load everything][Auto-load everything]]
 - [[How do I ... idiomatically?][How do I ... idiomatically?]]
   - [[Setup auto-completion for a major mode][Setup auto-completion for a major mode]]

* Introduction
This document is intended as a tutorial for users who are interested in writing
their first configuration layer, whether for private use or for contributing
upstream. It should help clear up some confusion regarding how layers work and
how Spacemacs (and Emacs) loads packages.

* Nomenclature
Layers and packages. What gives?

- Package :: A set of Emacs Lisp files that, taken together, provide some
     feature. Packages may be available on a package repository, such as ELPA or
     MELPA or on a third-party service provider (such as github) or even
     locally on the disk.
- Layer :: A collected unit of configuration that can be enabled (or disabled)
     in Spacemacs. A layer typically brings together one or more packages, as
     well as the glue configuration code required to make them play well with
     each other and Spacemacs in general.

Before writing a layer, it is helpful to consider what you are trying to
achieve. Is there a package that provides the functionality you are after, and
you want to integrate it in Spacemacs? If yes, you should write a layer. Are you
trying to implement a new feature that would be useful for the Emacs community
at large? In that case, consider whether it wouldn't be more appropriate to
write a package first, and then a layer that uses your package.

* The Emacs loading process
To understand how to best implement a layer, we have to investigate how Emacs
loads code.

** Emacs Lisp files
Emacs Lisp files contains code that can be evaluated. When evaluated, the
functions, macros and modes defined in that file become available to the current
Emacs session. Henceforth, this will be termed as /loading/ a file.

One major problem is to ensure that all the correct files are loaded, and in the
proper order. Another issue is to ensure that not too many files are loaded
immediately. This causes startup to take too long. Instead, we want to make sure
that files are loaded only as needed, and not all at once.

How is this done in Emacs, and how is it done in Spacemacs?

*** Loading a file
The simplest way to load a file is to call =load-file=.

#+begin_src emacs-lisp
  (load-file "~/elisp/foo.el")
#+end_src

This is as primitive as it comes. The path must be exact, and it does not have
to be in the Emacs load path (we'll get to that later). It will not look for a
byte-compiled =.elc= file. It will simply load exactly what you tell it to.

** Features
A better way to load what you need is to use /features/. A feature is a symbol
that typically has the same name as the file it resides in. Let us say you have
the following contents in a file called =my-feature.el=.

#+begin_src emacs-lisp
  ;; Your code goes here ...

  (provide 'my-feature)
#+end_src

To have Emacs load this file, call =require=, as such:

#+begin_src emacs-lisp
  (require 'my-feature)
#+end_src

This checks whether the feature =my-feature= has already been loaded. If not, it
looks for a file called =my-feature.el=, =my-feature.elc= or some such. If it
finds such a file, it will load it. When the call to =provide= is evaluated, the
feature is added to the list of loaded features, so that subsequent calls to
=require= will do nothing.

This will cause an error if no such file can be found.

The file =my-feature.el= may very well contain other calls to =require=, and in
fact this is quite a common way to ensure that dependencies are loaded before
your code runs.

Package authors should use this technique to make sure that dependencies are
loaded before their code runs.

*** The load path
When loaded using =require=, Emacs looks for files in its /load path/. This is
nothing more than a list of paths where elisp files can be found, and you can
inspect it through ~SPC h d v load-path~ in Spacemacs. To add to the load path,
simply push to this list, e.g.

#+begin_src emacs-lisp
  (push "/some/path/" load-path)
#+end_src

