doc/LAYERS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-23 Mon 13:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuration layers</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
                 href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css" />
</head>
<body>
<div id="content">
<div id="toggle-sidebar"><a href="#table-of-contents"><h2>Table of Contents</h2></a></div>
<h1 class="title">Configuration layers</h1>
<div id="table-of-contents">
<h2>Table of Contents<a href="#">Close</a></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Nomenclature</a></li>
<li><a href="#orgheadline10">3. The Emacs loading process</a>
<ul>
<li><a href="#orgheadline4">3.1. Emacs Lisp files</a>
<ul>
<li><a href="#orgheadline3">3.1.1. Loading a file</a></li>
</ul>
</li>
<li><a href="#orgheadline6">3.2. Features</a>
<ul>
<li><a href="#orgheadline5">3.2.1. The load path</a></li>
</ul>
</li>
<li><a href="#orgheadline7">3.3. Auto-loading</a></li>
<li><a href="#orgheadline8">3.4. Eval after load</a></li>
<li><a href="#orgheadline9">3.5. Use-package</a></li>
</ul>
</li>
<li><a href="#orgheadline13">4. Anatomy of a layer</a>
<ul>
<li><a href="#orgheadline11">4.1. packages.el</a></li>
<li><a href="#orgheadline12">4.2. config.el, funcs.el and keybindings.el</a></li>
</ul>
</li>
<li><a href="#orgheadline14">5. The Spacemacs loading process</a></li>
<li><a href="#orgheadline15">6. Case study: auto-completion</a></li>
<li><a href="#orgheadline25">7. Layer tips and tricks</a>
<ul>
<li><a href="#orgheadline16">7.1. Cross-dependencies</a></li>
<li><a href="#orgheadline17">7.2. Use-package</a></li>
<li><a href="#orgheadline18">7.3. Use-package hooks</a></li>
<li><a href="#orgheadline24">7.4. Best practices</a>
<ul>
<li><a href="#orgheadline19">7.4.1. Package ownership</a></li>
<li><a href="#orgheadline20">7.4.2. Localize your configuration</a></li>
<li><a href="#orgheadline21">7.4.3. Load ordering</a></li>
<li><a href="#orgheadline22">7.4.4. No require</a></li>
<li><a href="#orgheadline23">7.4.5. Auto-load everything</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline27">8. How do I &#x2026; idiomatically?</a>
<ul>
<li><a href="#orgheadline26">8.1. Setup auto-completion for a major mode</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document is intended as a tutorial for users who are interested in writing
their first configuration layer, whether for private use or for contributing
upstream. It should help clear up some confusion regarding how layers work and
how Spacemacs (and Emacs) loads packages.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Nomenclature</h2>
<div class="outline-text-2" id="text-2">
<p>
Layers and packages. What gives?
</p>

<dl class="org-dl">
<dt>Package</dt><dd>A set of Emacs Lisp files that, taken together, provide some
feature. Packages may be available on a package repository, such as ELPA or
MELPA or on a third-party service provider (such as github) or even
locally on the disk.</dd>
<dt>Layer</dt><dd>A collected unit of configuration that can be enabled (or disabled)
in Spacemacs. A layer typically brings together one or more packages, as
well as the glue configuration code required to make them play well with
each other and Spacemacs in general.</dd>
</dl>

<p>
Before writing a layer, it is helpful to consider what you are trying to
achieve. Is there a package that provides the functionality you are after, and
you want to integrate it in Spacemacs? If yes, you should write a layer. Are you
trying to implement a new feature that would be useful for the Emacs community
at large? In that case, consider whether it wouldn't be more appropriate to
write a package first, and then a layer that uses your package.
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">3</span> The Emacs loading process</h2>
<div class="outline-text-2" id="text-3">
<p>
To understand how to best implement a layer, we have to investigate how Emacs
loads code.
</p>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.1</span> Emacs Lisp files</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Emacs Lisp files contains code that can be evaluated. When evaluated, the
functions, macros and modes defined in that file become available to the current
Emacs session. Henceforth, this will be termed as <i>loading</i> a file.
</p>

<p>
One major problem is to ensure that all the correct files are loaded, and in the
proper order. Another issue is to ensure that not too many files are loaded
immediately. This causes startup to take too long. Instead, we want to make sure
that files are loaded only as needed, and not all at once.
</p>

<p>
How is this done in Emacs, and how is it done in Spacemacs?
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">3.1.1</span> Loading a file</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
The simplest way to load a file is to call <code>load-file</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>load-file <span class="org-string">"~/elisp/foo.el"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This is as primitive as it comes. The path must be exact, and it does not have
to be in the Emacs load path (we'll get to that later). It will not look for a
byte-compiled <code>.elc</code> file. It will simply load exactly what you tell it to.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.2</span> Features</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A better way to load what you need is to use <i>features</i>. A feature is a symbol
that typically has the same name as the file it resides in. Let us say you have
the following contents in a file called <code>my-feature.el</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Your code goes here ...</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">provide</span> '<span class="org-constant">my-feature</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
To have Emacs load this file, call <code>require</code>, as such:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> '<span class="org-constant">my-feature</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This checks whether the feature <code>my-feature</code> has already been loaded. If not, it
looks for a file called <code>my-feature.el</code>, <code>my-feature.elc</code> or some such. If it
finds such a file, it will load it. When the call to <code>provide</code> is evaluated, the
feature is added to the list of loaded features, so that subsequent calls to
<code>require</code> will do nothing.
</p>

<p>
This will cause an error if no such file can be found.
</p>

<p>
The file <code>my-feature.el</code> may very well contain other calls to <code>require</code>, and in
fact this is quite a common way to ensure that dependencies are loaded before
your code runs.
</p>

<p>
Package authors should use this technique to make sure that dependencies are
loaded before their code runs.
</p>
</div>

<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">3.2.1</span> The load path</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
When loaded using <code>require</code>, Emacs looks for files in its <i>load path</i>. This is
nothing more than a list of paths where elisp files can be found, and you can
inspect it through <code>SPC h d v load-path</code> in Spacemacs. To add to the load path,
simply push to this list, e.g.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>push <span class="org-string">"/some/path/"</span> load-path<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
