doc/LAYERS.html

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.3</span> Auto-loading</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Calling <code>require</code> is nothing more than a glorified way of calling <code>load-file</code>.
It solves the problem of ensuring that files are loaded in the correct order,
and to some degree it solved the problem of where to find the files on disk but
a long list of calls to <code>require</code> at startup would still cause Emacs to take for
ever to load.
</p>

<p>
Emacs uses auto-loading to solve this problem. When a function is registered as
auto-loading, an "empty" definition is provided. When that function is called,
the file that provides the function is immediately loaded (along with all its
required features). Finally, the "empty" function is substituted with the real
one and called normally. The end user will see only a slight delay when first
calling the function, while subsequent calls to that function (or any other
function loaded as part of the same procedure) will be as quick as normal.
</p>

<p>
To register a function as auto-loadable, we call <code>autoload</code>:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>autoload 'some-function <span class="org-string">"some-file"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This instructs Emacs that whenever <code>some-function</code> is called, load
<code>some-file.el</code> first, and then proceed.
</p>

<p>
After evaluating the above code, you can try to inspect <code>some-function</code> by doing
<code>SPC h d f some-function</code>. It will say it's an auto-loaded function, and that
nothing else is known about it until it is loaded. The call to <code>autoload</code> can
optionally include more information, such as a doc-string, whether the function
can be called interactively, and so on. This provides more information to the
end-user without her having to actually load the file first.
</p>

<p>
Open your <code>elpa</code> directory, go to <code>helm</code> and look at the file
<code>helm-autoloads.el</code>. This provides all the auto-loads for all the files in Helm.
However, this file is not written by hand. Instead, it is automatically
generated from "magic" comments in the source code of Helm. They look like this:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">my-function</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Source code...</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
The magic comment <code>;;;###autoload</code> instructs Emacs that the following definition
should be auto-loaded. This automatically generates an appropriate call to
<code>autoload</code>.
</p>

<p>
Things that can be auto-loaded generally involve anything "definable", such as
functions, macros, major or minor modes, groups, classes, and so on.
</p>

<p>
Magic comments also work on other things, such as variable definitions
(<code>defvar</code>), but in that case, the definition is just copied verbatim into the
auto-loading file. For example, this code will load Helm on startup, long before
your file is actually evaluated, probably not what was intended:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">require</span> '<span class="org-constant">helm</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
It is the responsibility of the package authors to ensure that their package can
be appropriately auto-loaded, and most packages do this quite well.
</p>

<p>
Spacemacs makes thorough use of auto-loading. Almost everything in Spacemacs is
loaded when needed instead of right away.
</p>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.4</span> Eval after load</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Often, we will want to configure packages after loading them. We may want to set
some variables or call some functions. This is trivial with <code>require</code>, because
it loads immediately, but it can be tricky with autoloading, because the
configuration code must also be deferred.
</p>

<p>
Emacs offers <code>with-eval-after-load</code> for this purpose. It can be used like this:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">with-eval-after-load</span> 'helm
     <span class="org-comment-delimiter">;; </span><span class="org-comment">Code</span>
     <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This arranges for the relevant code to be executed after Helm is loaded (using
either <code>require</code> or an autoload), or if Helm is already loaded, the code is
executed immediately.
</p>

<p>
Since <code>with-eval-after-load</code> is a macro and not a function, its argument does
not have to be quoted.
</p>

<p>
<b><b>Note</b></b>: <code>with-eval-after-load</code> is backported for those still on Emacs 24.3
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.5</span> Use-package</h3>
<div class="outline-text-3" id="text-3-5">
<p>
For <i>end users</i> who are trying to put together an efficient Emacs configuration,
there is a very useful <i>package</i> called <code>use-package</code> that provides a macro
which is <i>also</i> called <code>use-package</code> which does a very good job of streamlining
the whole process of loading packages.
</p>

<p>
The aspiring layer author is recommended to have a look at the <code>use-package</code>
<a href="https://github.com/jwiegley/use-package">documentation</a>. Some examples follow.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This simply loads Helm. It is essentially equivalent to <code>(require 'helm)</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm</span>
  <span class="org-builtin">:defer</span> t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This defers the loading of Helm using the auto-load facility and the auto-load
commands provided by the Helm source code. It is, in fact, a no-op.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm</span>
  <span class="org-builtin">:defer</span> t
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code to execute before Helm is loaded</span>
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code to execute after Helm is loaded</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This form includes code to execute before and after Helm is loaded. The <code>:init</code>
section can be executed immediately, but since Helm is deferred, the <code>:config</code>
section is not executed until after loading, if ever. It is essentially
equivalent to simply running the <code>:init</code> block, and then adding the <code>:config</code>
block in an <code>with-eval-after-load</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">helm</span>
  <span class="org-builtin">:commands</span> <span class="org-rainbow-delimiters-depth-2">(</span>helm-find-files helm-M-x<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This creates auto-load references for additional commands, if you find that the
package author has been slacking.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">use-package</span> <span class="org-constant">ruby-mode</span>
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.rb\\'"</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
For packages that provide major modes, you can associate file extensions to that
mode by using the <code>:mode</code> keyword. This adds an entry to <code>auto-mode-alist</code> and
an auto-load for <code>ruby-mode</code>. Typically this is not required, as <code>ruby-mode</code>
should already be auto-loadable, and the package should associate Ruby files
with itself already.
</p>

<p>
Use-package supports heaps of useful keywords. Look at the <a href="https://github.com/jwiegley/use-package">documentation</a> for
more.
</p>
</div>
</div>
</div>
