doc/LAYERS.html

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">4</span> Anatomy of a layer</h2>
<div class="outline-text-2" id="text-4">
<p>
A layer is simply a folder somewhere in Spacemacs' layer search path that
contains <i>at least one</i> of these files, ordered vaguely by importance.
</p>

<dl class="org-dl">
<dt><code>packages.el</code></dt><dd>for specifying which packages the layer uses</dd>
<dt><code>config.el</code></dt><dd>for miscellaneous configuration</dd>
<dt><code>funcs.el</code></dt><dd>for defining general utility functions</dd>
<dt><code>keybindings.el</code></dt><dd>for defining general keybindings</dd>
</dl>

<p>
Additionally, for each local package (see the next section), there should be a
folder <code>&lt;layer&gt;/local/&lt;package&gt;/</code> containing the source code for that package.
Before initializing that package, Spacemacs will add this folder to the load
path for you.
</p>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">4.1</span> packages.el</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This file should define a variable called <code>&lt;layer&gt;-packages</code>, which should be a
list of all the packages that this layer needs. Some valid package
specifications are as follows.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq mylayer-packages
      '<span class="org-rainbow-delimiters-depth-2">(</span>
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Get the package from MELPA, ELPA, etc.</span>
        some-package
        <span class="org-rainbow-delimiters-depth-3">(</span>some-package <span class="org-builtin">:location</span> elpa<span class="org-rainbow-delimiters-depth-3">)</span>

        <span class="org-comment-delimiter">;; </span><span class="org-comment">A local package</span>
        <span class="org-rainbow-delimiters-depth-3">(</span>some-package <span class="org-builtin">:location</span> local<span class="org-rainbow-delimiters-depth-3">)</span>

        <span class="org-comment-delimiter">;; </span><span class="org-comment">A package recipe</span>
        <span class="org-rainbow-delimiters-depth-3">(</span>some-package <span class="org-builtin">:location</span> <span class="org-rainbow-delimiters-depth-4">(</span>recipe
                                 <span class="org-builtin">:fetcher</span> github
                                 <span class="org-builtin">:repo</span> <span class="org-string">"some/repo"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>

        <span class="org-comment-delimiter">;; </span><span class="org-comment">An excluded package</span>
        <span class="org-rainbow-delimiters-depth-3">(</span>some-package <span class="org-builtin">:excluded</span> t<span class="org-rainbow-delimiters-depth-3">)</span>
        <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
The <code>:location</code> attribute specifies where the package may be found. Spacemacs
currently supports packages on ELPA compliant repositories, local packages and
MELPA recipes (through the Quelpa package). See the <a href="https://github.com/milkypostman/melpa#recipe-format">MELPA documentation</a> for more
information about recipes.
</p>

<p>
Packages may be <i>excluded</i> by setting the <code>:excluded</code> property to true. This
will prevent the package from being installed even if it is used by another
layer.
</p>

<p>
For each included package, you may define one or more of the following
functions, which are called in order by Spacemacs to initialize the package.
</p>

<ol class="org-ol">
<li><code>&lt;layer&gt;/pre-init-&lt;package&gt;</code></li>
<li><code>&lt;layer&gt;/init-&lt;package&gt;</code></li>
<li><code>&lt;layer&gt;/post-init-&lt;package&gt;</code></li>
</ol>

<p>
It is the responsibility of these functions to load and configure the package in
question. Spacemacs will do nothing other than download the package and place it
in the load path for you.
</p>

<p>
<b>Note:</b> A package will not be installed unless at least one layer defines an
<code>init</code> function for it. That is to say, in a certain sense, the <code>init</code> function
does mandatory setup while the <code>pre-init</code> and <code>post-init</code> functions do optional
setup. This can be used for managing cross-layer dependencies, which we will
discuss later.
</p>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">4.2</span> config.el, funcs.el and keybindings.el</h3>
<div class="outline-text-3" id="text-4-2">
<p>
These files contain no magic variables or functions, merely code that is
executed. The intended use cases are
</p>

<dl class="org-dl">
<dt>config.el</dt><dd>configuration code that is independent of packages, declaration
layer variables, and so on</dd>
<dt>funcs.el</dt><dd>definition of general utility functions</dd>
<dt>keybindings.el</dt><dd>general keybindings</dd>
</dl>

<p>
The word <i>general</i> here means <i>independent of any package</i>. Since the end user
can exclude an arbitrary set of packages, you cannot be sure that, just because
your layer includes a package, that package will necessarily be loaded. For this
reason, code in these files must be generally safe, regardless of which packages
are installed.
</p>

<p>
More on this in the next section.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">5</span> The Spacemacs loading process</h2>
<div class="outline-text-2" id="text-5">
<p>
The Spacemacs loading process can be summarized as follows:
</p>

<ol class="org-ol">
<li>A handful of packages are installed and loaded as part of the bootstrap process.
Among these packages, of particular interest to us, is <code>use-package</code>. All
subsequent code in the loading process may make use of it.</li>
<li>Spacemacs goes through all the enabled layers and evaluates their files. The
changes introduced by <code>config.el</code> are thus applied, but nothing happens from
<code>packages.el</code>, since these files only define functions and variables.</li>
<li><p>
Spacemacs checks which packages should be downloaded and installed. To be
installed, a package must be
</p>
<ul class="org-ul">
<li>included by a layer that the user has enabled,</li>
<li>not be excluded by any other layer that the user has enabled,</li>
<li>not be excluded by the user herself, and</li>
<li>there must be at least one <code>&lt;layer&gt;/init-&lt;package&gt;</code> function defined for
it.</li>
</ul>
<p>
Alternatively, if a package is part of the end user's
<code>dotspacemacs-additional-packages</code>, it will also be installed.
</p></li>
<li>All packages which should be installed are installed, and all packages which
are installed but which shouldn't be are removed. (This last behavior is
optional but default.)</li>
<li>The <code>pre-init</code>, <code>init</code> and <code>post-init</code> functions for each installed package
are executed in turn.</li>
</ol>

<p>
It is step five that interests us. It is very important that a package is not
installed if no <code>init</code> function is defined for it.
</p>

<p>
We say that a layer <b>owns</b> a package if it defines an <code>init</code> function for it. A
layer does <b>not</b> own a package if it only defines <code>pre-init</code> or <code>post-init</code>
functions.
</p>

<p>
Only one layer may own a package. Since layers are processed in order of
specification in the user's dotfile, it is possible for layers to "seize"
ownership of a package that was owned by a previously enabled layer.
</p>
</div>
</div>
