doc/LAYERS.html

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">6</span> Case study: auto-completion</h2>
<div class="outline-text-2" id="text-6">
<p>
Spacemacs provides a layer called <code>auto-completion</code> which provides
auto-completion features in many modes. It does this using the package
<code>company</code>. This layer owns the <code>company</code> package, so it defines a function
called <code>auto-completion/init-company</code>.
</p>

<p>
When a user enables the <code>auto-completion</code> layer, Spacemacs locates it and finds
<code>company</code> in the list of packages. Provided that <code>company</code> is not excluded,
either by the user or another layer, Spacemacs then locates and runs the <code>init</code>
function for <code>company</code>. This function includes a call to <code>use-package</code> that sets
up the basic configuration.
</p>

<p>
However, auto-completion is a two-horse game. By its very nature, it is specific
to the major mode in question. It is pointless to expect the <code>auto-completion</code>
layer to include configuration for each conceivable major mode, and equally
futile to expect each programming language layer (python, ruby, etc.) to fully
configure <code>company</code> on their own.
</p>

<p>
This is solved using the <code>post-init</code> functions. The Python layer, for example,
includes the <code>company</code> package and defines a function called
<code>python/post-init-company</code>. This function is called after
<code>auto-completion/init-company</code>, but it is not called if
</p>

<ul class="org-ul">
<li>the <code>auto-completion</code> layer is not enabled, in which case no <code>init</code> function
for <code>company</code> will be found, or</li>
<li>the <code>company</code> package is excluded either by the user or another layer</li>
</ul>

<p>
As such, <code>python/post-init-company</code> is the <i>only</i> safe place to put
configuration related to <code>company</code> in Python mode.
</p>

<p>
If the Python layer had defined an <code>init</code> function for <code>company</code>, that package
would have been installed even if the <code>auto-completion</code> layer had been disabled,
which is not what we want.
</p>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">7</span> Layer tips and tricks</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">7.1</span> Cross-dependencies</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Spacemacs provides a couple of additional useful functions you can use to check
whether other layers or packages are included.
</p>

<dl class="org-dl">
<dt><code>configuration-layer/layer-usedp</code></dt><dd>check if a layer is enabled</dd>
<dt><code>configuration-layer/package-usedp</code></dt><dd>check if a package is or will be installed</dd>
</dl>

<p>
These are useful in some cases, but usually you can get the desired result just
by using <code>post-init</code> functions.
</p>

<p>
For layers that require another layers to be enabled, use the functions
<code>configuration-layer/declare-layer</code> and <code>configuration-layer/declare-layers</code> to
ensure that layers are enabled even if the user has not enabled them explicitly.
Calls to these functions must go in the <code>config.el</code> file.
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">7.2</span> Use-package</h3>
<div class="outline-text-3" id="text-7-2">
<p>
In the vast majority of cases, a package <code>init</code> function should do nothing but
call to <code>use-package</code>. Again, in the vast majority of cases, all the
configuration you need to do should be doable within the <code>:init</code> or <code>:config</code>
blocks of such a call.
</p>

<p>
What goes where? Since <code>:init</code> is executed before load and <code>:config</code> after,
these rules of thumb apply.
</p>

<p>
In <code>:config</code> should be
</p>
<ul class="org-ul">
<li>Anything that requires the package to be already loaded.</li>
<li>Anything that takes a long time to run, which would ruin startup performance.</li>
</ul>

<p>
The <code>:init</code> block should contain setup for the entry points to the package. This
includes keybindings, if the package should be loaded manually by the user, or
hooks, if the package should be loaded upon some event. It is not unusual to
have both!
</p>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">7.3</span> Use-package hooks</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Spacemacs includes a macro for adding more code to the <code>:init</code> or <code>:config</code>
blocks of a call to <code>use-package</code>, after the fact. This is useful for <code>pre-init</code>
or <code>post-init</code> functions to "inject" code into the <code>use-package</code> call of the
<code>init</code> function.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>spacemacs|use-package-add-hook helm
  <span class="org-builtin">:pre-init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code</span>
  <span class="org-builtin">:post-init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code</span>
  <span class="org-builtin">:pre-config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code</span>
  <span class="org-builtin">:post-config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code</span>
  <span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Since a call to <code>use-package</code> may evaluate the <code>:init</code> block immediately, any
function that wants to inject code into this block must run <code>before</code> the call to
<code>use-package</code>. Further, since this call to <code>use-package</code> typically takes place
in the <code>init-&lt;package&gt;</code> function, calls to <code>spacemacs|use-package-add-hook</code>
typically happen in the <code>pre-init-&lt;package&gt;</code> functions, and not in
<code>post-init-&lt;package&gt;</code>. It is quite safe to do this in <code>pre-init</code>, so that should
be the default choice.
</p>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">7.4</span> Best practices</h3>
<div class="outline-text-3" id="text-7-4">
<p>
If you break any of these rules, you should know what you are doing and have a
good reason for doing it.
</p>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">7.4.1</span> Package ownership</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
Each package should be owned by one layer only. The layer that owns the
package should define its <code>init</code> function. Other layers should rely on
<code>pre-init</code> or <code>post-init</code> functions.
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">7.4.2</span> Localize your configuration</h4>
<div class="outline-text-4" id="text-7-4-2">
<p>
<b>Each function can only assume the existence of one package.</b> With some
exceptions, the <code>pre-init</code>, <code>init</code> and <code>post-init</code> functions can <i>only</i>
configure exactly the package they are defined for. Since the user can exclude
an arbitrary set of packages, there is no <i>a priori</i> safe way to assume that
another package is included. Use <code>configuration-layer/package-usedp</code> if you
must.
</p>

<p>
This can be very challenging, so please take this as a guideline and not
something that is absolute. It is quite possible for the user to break her
Spacemacs installation by excluding the wrong packages, and it is not our
intention to prevent this at all costs.
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">7.4.3</span> Load ordering</h4>
<div class="outline-text-4" id="text-7-4-3">
<p>
In Spacemacs, layers are loaded in order of inclusion in the dotfile, and
packages are loaded in alphabetical order. In the rare cases where you make use
of this property, you should make sure to document it well. Many will assume
that layers can be included in arbitrary order (which is true in most cases),
and that packages can be renamed without problems (which is also in most cases).
</p>

<p>
Preferably, write your layer so that it is independent of load ordering. The
<code>pre</code>- and <code>post-init</code> functions are helpful, together with
<code>configuration-layer/package-usedp</code>.
</p>
</div>
</div>
