doc/LAYERS.org
*** No require
Do not use require. If you find yourself using =require=, you are almost
certainly doing something wrong. Packages in Spacemacs should be loaded through
auto-loading, and not explicitly by you. Calls to =require= in package init
functions will cause a package to be loaded upon startup. Code in an =:init=
block of =use-package= should not cause anything to be loaded, either. If you
need a =require= in a =:config= block, that is a sign that some other package is
missing appropriate auto-loads.

*** Auto-load everything
Defer everything. You should have a very good reason not to defer the loading
of a package.

* How do I ... idiomatically?

** Setup auto-completion for a major mode
In your layer's =config.el=, call =spacemacs|defvar-company-backends=.

#+begin_src emacs-lisp
  (spacemacs|defvar-company-backends yoyo-mode)
#+end_src

This creates a variable called =company-backends-yoyo-mode=. In the package
=init= functions, you should push backends to this variable. But of course, only
if the =auto-completion= layer is enabled.

#+begin_src emacs-lisp
  (setq yoyo-packages '(
                        ;; ...
                        some-weird-package
                        ;; ...
                        )

  (when (configuration-layer/layer-usedp 'auto-completion)
    (defun yoyo/init-some-weird-package ()
      (use-package some-weird-package
        ;; Only if company is installed
        :if (configuration-layer/package-usedp 'company)
        :defer t
        ;; This has to be in init because it's a package entry point
        :init
        (push 'some-weird-backend company-backends-yoyo-mode))))
#+end_src

Finally, we must make sure company is started when we enter =yoyo-mode=, but
again only if the =auto-completion= layer is enabled.

#+begin_src emacs-lisp
  (setq yoyo-packages '(
                        ;; ...
                        yoyo-mode
                        ;; ...
                        ))

  (defun yoyo/init-yoyo-mode ()
    (use-package yoyo-mode
      ;; Some configuration goes here, however nothing relating to company
      ;; since this function may be called even if company is not installed!
      ))

  (when (configuration-layer/package-usedp 'company)
    (defun yoyo/post-init-yoyo-mode ()
      ;; This makes no reference to `some-weird-package', which may have
      ;; been excluded by the user
      (spacemacs|add-company-hook yoyo-mode)))
#+end_src
