doc/LAYERS.html

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">7.4.4</span> No require</h4>
<div class="outline-text-4" id="text-7-4-4">
<p>
Do not use require. If you find yourself using <code>require</code>, you are almost
certainly doing something wrong. Packages in Spacemacs should be loaded through
auto-loading, and not explicitly by you. Calls to <code>require</code> in package init
functions will cause a package to be loaded upon startup. Code in an <code>:init</code>
block of <code>use-package</code> should not cause anything to be loaded, either. If you
need a <code>require</code> in a <code>:config</code> block, that is a sign that some other package is
missing appropriate auto-loads.
</p>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">7.4.5</span> Auto-load everything</h4>
<div class="outline-text-4" id="text-7-4-5">
<p>
Defer everything. You should have a very good reason not to defer the loading
of a package.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">8</span> How do I &#x2026; idiomatically?</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">8.1</span> Setup auto-completion for a major mode</h3>
<div class="outline-text-3" id="text-8-1">
<p>
In your layer's <code>config.el</code>, call <code>spacemacs|defvar-company-backends</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>spacemacs|defvar-company-backends yoyo-mode<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This creates a variable called <code>company-backends-yoyo-mode</code>. In the package
<code>init</code> functions, you should push backends to this variable. But of course, only
if the <code>auto-completion</code> layer is enabled.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq yoyo-packages '<span class="org-rainbow-delimiters-depth-2">(</span>
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">...</span>
                      some-weird-package
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">...</span>
                      <span class="org-rainbow-delimiters-depth-2">)</span>

<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-3">(</span>configuration-layer/layer-usedp 'auto-completion<span class="org-rainbow-delimiters-depth-3">)</span>
  <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">defun</span> <span class="org-function-name">yoyo/init-some-weird-package</span> <span class="org-rainbow-delimiters-depth-4">()</span>
    <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">use-package</span> <span class="org-constant">some-weird-package</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Only if company is installed</span>
      <span class="org-builtin">:if</span> <span class="org-rainbow-delimiters-depth-5">(</span>configuration-layer/package-usedp 'company<span class="org-rainbow-delimiters-depth-5">)</span>
      <span class="org-builtin">:defer</span> t
      <span class="org-comment-delimiter">;; </span><span class="org-comment">This has to be in init because it's a package entry point</span>
      <span class="org-builtin">:init</span>
      <span class="org-rainbow-delimiters-depth-5">(</span>push 'some-weird-backend company-backends-yoyo-mode<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
</pre>
</div>

<p>
Finally, we must make sure company is started when we enter <code>yoyo-mode</code>, but
again only if the <code>auto-completion</code> layer is enabled.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq yoyo-packages '<span class="org-rainbow-delimiters-depth-2">(</span>
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">...</span>
                      yoyo-mode
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">...</span>
                      <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span> <span class="org-function-name">yoyo/init-yoyo-mode</span> <span class="org-rainbow-delimiters-depth-2">()</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">use-package</span> <span class="org-constant">yoyo-mode</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Some configuration goes here, however nothing relating to company</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">since this function may be called even if company is not installed!</span>
    <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-2">(</span>configuration-layer/package-usedp 'company<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">defun</span> <span class="org-function-name">yoyo/post-init-yoyo-mode</span> <span class="org-rainbow-delimiters-depth-3">()</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">This makes no reference to `</span><span class="org-comment"><span class="org-constant">some-weird-package</span></span><span class="org-comment">', which may have</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">been excluded by the user</span>
    <span class="org-rainbow-delimiters-depth-3">(</span>spacemacs|add-company-hook yoyo-mode<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-23 Mon 13:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
